# -*- coding: utf-8 -*-
import os
import sys
import unittest
from django.test import TestCase
# from django import forms
path = os.path.join(os.path.dirname(__file__), '../')
sys.path.append(path)
print("sys:")
print(path)
# from forms import projectForm
# print(sys.path.append(projectForm))
from .cloud_conductor_gui2.gui_app.forms import projectForm
# from gui_app.views import projectViews


class testFormProjectList1(unittest.TestCase):

#     def setUp(self):
#         pass
#
#     def tearDown(self):
#         pass

    # Normal test - All nomal
    def test_1(self):

        data = {
            'auth_token': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％',
            'name': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％',
            'description': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％'
        }

        form = projectForm(data)

#         test_ret = '1'
#         ret = '1'
#         self.assertEqual(ret, test_ret)

        self.assertTrue(form.is_valid())

    # Abnormal test - Required
    def test_2(self):

        data = {
            'auth_token': '',
            'name': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％',
            'description': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％'
        }

        form = projectForm(data)

        self.assertFalse(form.is_valid())

    # Abnormal test - Number of characters exceeded
    def test_3(self):

        data = {
            'auth_token': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％（',
            'name': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％',
            'description': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％'

        }

        form = projectForm(data)

        self.assertFalse(form.is_valid())

    # Normal test - Alphanumeric symbol
    def test_4(self):

        data = {
             'auth_token': 'aA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lL@mM:nNoOpPqQrRsStTuUvVwWHiIjJaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lLaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lL@mM:nNoOpPqQrRsStTuUvVwWHiIjJaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lLaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lL@mM:nNoOpPqQrRsStTuUvVwWHiIjJaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lLaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lL@mM:nNoOpPqQrRsStTuUvVwWHiIjJaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lLaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lL@mM:nNoOpPqQrRsStTuUvVwWHiIjJaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lLaA/bB',
            'name': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％',
            'description': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％'
        }

        form = projectForm(data)

        self.assertTrue(form.is_valid())

    # Abnormal test - Required
    def test_5(self):

        data = {
             'auth_token': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％',
            'name': '',
            'description': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％'
        }

        form = projectForm(data)

        self.assertFalse(form.is_valid())

    # Abnormal test - Number of characters exceeded
    def test_6(self):

        data = {
             'auth_token': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％',
            'name': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％（',
            'description': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％'
        }

        form = projectForm(data)

        self.assertTrue(form.is_valid())

    # Normal test - Alphanumeric symbol
    def test_7(self):

        data = {
             'auth_token': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％',
            'name': 'aA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lL@mM:nNoOpPqQrRsStTuUvVwWHiIjJaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lLaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lL@mM:nNoOpPqQrRsStTuUvVwWHiIjJaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lLaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lL@mM:nNoOpPqQrRsStTuUvVwWHiIjJaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lLaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lL@mM:nNoOpPqQrRsStTuUvVwWHiIjJaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lLaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lL@mM:nNoOpPqQrRsStTuUvVwWHiIjJaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lLaA/bB',
            'description': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％'
        }

        form = projectForm(data)

        self.assertTrue(form.is_valid())

    # Normal test - Required
    def test_8(self):

        data = {
             'auth_token': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％',
            'name': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％',
            'description': ''
        }

        form = projectForm(data)

        self.assertTrue(form.is_valid())

    # Abnormal test - Number of characters exceeded
    def test_9(self):

        data = {
             'auth_token': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％',
            'name': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％',
            'description': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％（'
        }

        form = projectForm(data)

        self.assertFalse(form.is_valid())

    # Normal test - Alphanumeric symbol
    def test_10(self):

        data = {
             'auth_token': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％',
            'name': 'テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（）＝￥テストてすと１２３４５ＡＢＣＤＥ！？＃＄％＆（)！？＃＄％',
            'description': 'aA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lL@mM:nNoOpPqQrRsStTuUvVwWHiIjJaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lLaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lL@mM:nNoOpPqQrRsStTuUvVwWHiIjJaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lLaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lL@mM:nNoOpPqQrRsStTuUvVwWHiIjJaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lLaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lL@mM:nNoOpPqQrRsStTuUvVwWHiIjJaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lLaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lL@mM:nNoOpPqQrRsStTuUvVwWHiIjJaA/bB.cC-dD_eE@fF&gG:hH/iI.jJ-kK_lLaA/bB'
        }

        form = projectForm(data)

        self.assertTrue(form.is_valid())


if __name__ == "__main__":
    # import sys;sys.argv = ['', 'Test.testName']
    unittest.main()
